<?php

// Целые числа
echo 1 <=> 1, '<br>'; // 0
echo 1 <=> 2, '<br>'; // -1
echo 2 <=> 1, '<br>'; // 1

// Числа с плавающей точкой
echo 1.5 <=> 1.5, '<br>'; // 0
echo 1.5 <=> 2.5, '<br>'; // -1
echo 2.5 <=> 1.5, '<br>'; // 1

// строки
echo "a" <=> "a", '<br>'; // 0
echo "a" <=> "b", '<br>'; // -1
echo "b" <=> "a", '<br>'; // 1
echo "a" <=> "aa", '<br>'; // -1
echo "zz" <=> "aa", '<br>'; // 1

// массивы
echo [] <=> [], '<br>'; // 0
echo [1,2,3] <=> [1, 2, 3], '<br>'; // 0
echo [1, 2, 3] <=> [], '<br>'; // 1
echo [1, 2, 3] <=> [1, 2, 1], '<br>'; // 1
echo [1, 2, 3] <=> [1, 2, 4], '<br>'; // -1

// Объекты
$a = (object) ["a" => "b"];
$b = (object) ["a" => "b"];
echo $a <=> $b, '<br>'; // 0

$a = (object) ["a" => "b"];
$b = (object) ["a" => "c"];
echo $a <=> $b, '<br>'; // -1

$a = (object) ["a" => "c"];
$b = (object) ["a" => "b"];
echo $a <=> $b, '<br>'; // 1

// Сравниваются не только значения; ключи тоже должны совпадать
$a = (object) ["a" => "b"];
$b = (object) ["b" => "b"];
echo $a <=> $b, '<br>'; // 1
